emacs_capslock_ctrl.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-08-24 Sat 21:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs - CapsLock as Ctrl</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs - CapsLock as Ctrl</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4ff94fc">Background</a></li>
<li><a href="#orgfafbd0b">Methods</a>
<ul>
<li><a href="#org59b2e95">Xmodmap</a></li>
<li><a href="#org9f25628">Gnome</a></li>
<li><a href="#org1eb8091">KDE</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4ff94fc" class="outline-2">
<h2 id="org4ff94fc">Background</h2>
<div class="outline-text-2" id="text-org4ff94fc">
<p>
Usually, key <code>CapsLock</code> is seldom used in our daily utilization, while key <code>Ctrl</code> is frequently used, esp. for Emacs users. Therefore, we can turn <code>CapsLock</code> into an additional <code>Ctrl</code>.
</p>
</div>
</div>
<div id="outline-container-orgfafbd0b" class="outline-2">
<h2 id="orgfafbd0b">Methods</h2>
<div class="outline-text-2" id="text-orgfafbd0b">
</div>
<div id="outline-container-org59b2e95" class="outline-3">
<h3 id="org59b2e95">Xmodmap</h3>
<div class="outline-text-3" id="text-org59b2e95">
<p>
<code>xmodmap</code> is a utility for remapping keys in <code>Xorg</code>. To turn <code>CapsLock</code> into another <code>Ctrl</code>, install package <code>xorg-xmodmap</code>, e.g.
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S xorg-xmodmap
</pre>
</div>
<p>
and create <code>~/.Xmodmap</code> with its contents as follows.
</p>
<div class="org-src-container">
<pre class="src src-sh">clear lock
clear control
add control = Caps_Lock Control_L Control_R
keycode 66 = Control_L
</pre>
</div>
<p>
For display manager, e.g. GDM, KDM, XDM, based startup, that is all. For <code>startx</code>-based, add a following entry in <code>~/.xinitrc</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh">[[ -f ~/.Xmodmap ]] &amp;&amp; xmodmap ~/.Xmodmap
</pre>
</div>
</div>
</div>
<div id="outline-container-org9f25628" class="outline-3">
<h3 id="org9f25628">Gnome</h3>
<div class="outline-text-3" id="text-org9f25628">
<p>
For Gnome, it is extremely easy to turn <code>CapsLock</code> into an additional <code>Ctrl</code>. Install package <code>gnome-tweak-tool</code>, e.g.
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S gnome-tweak-tool
</pre>
</div>
<p>
and configure it in the installed <code>Tweak Tool</code>. Enter <code>Typing</code> -&gt; <code>Caps Lock key behavior</code> and tick the radio <code>Caps Lock is also a Ctrl</code>.
</p>
</div>
</div>
<div id="outline-container-org1eb8091" class="outline-3">
<h3 id="org1eb8091">KDE</h3>
<div class="outline-text-3" id="text-org1eb8091">
<p>
For KDE, the transformation can be directly finished in the <code>system settings</code>. Enter <code>Input Devices</code> -&gt; <code>Keyboard</code> -&gt; <code>Advanced</code>, and tick the radio <code>Caps Lock is also a Ctrl</code> in <code>Caps Lock behavior</code> and <code>Caps Lock as Ctrl</code> in <code>Ctrl position</code>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
